; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=387, out_folder=./training, instance_id=89, seed=2113, goal_proportion=0.03

(define (problem blocksworld-89)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 b373 b374 b375 b376 b377 b378 b379 b380 b381 b382 b383 b384 b385 b386 b387 - object)
 (:init 
    (arm-empty)
    (clear b172)
    (on b172 b86)
    (on b86 b328)
    (on b328 b83)
    (on-table b83)
    (clear b235)
    (on b235 b48)
    (on b48 b377)
    (on-table b377)
    (clear b161)
    (on b161 b329)
    (on b329 b198)
    (on-table b198)
    (clear b33)
    (on-table b33)
    (clear b170)
    (on b170 b17)
    (on-table b17)
    (clear b97)
    (on b97 b72)
    (on b72 b218)
    (on b218 b94)
    (on b94 b269)
    (on-table b269)
    (clear b145)
    (on b145 b195)
    (on b195 b110)
    (on-table b110)
    (clear b105)
    (on b105 b146)
    (on b146 b112)
    (on b112 b239)
    (on-table b239)
    (clear b80)
    (on b80 b204)
    (on b204 b10)
    (on b10 b383)
    (on b383 b252)
    (on b252 b353)
    (on b353 b223)
    (on b223 b335)
    (on b335 b140)
    (on-table b140)
    (clear b59)
    (on-table b59)
    (clear b19)
    (on b19 b131)
    (on b131 b301)
    (on-table b301)
    (clear b257)
    (on b257 b272)
    (on-table b272)
    (clear b53)
    (on b53 b336)
    (on b336 b126)
    (on b126 b114)
    (on b114 b68)
    (on b68 b319)
    (on b319 b233)
    (on b233 b125)
    (on b125 b300)
    (on b300 b251)
    (on-table b251)
    (clear b262)
    (on b262 b197)
    (on b197 b266)
    (on b266 b5)
    (on b5 b315)
    (on b315 b237)
    (on b237 b134)
    (on b134 b330)
    (on b330 b109)
    (on b109 b267)
    (on-table b267)
    (clear b90)
    (on b90 b89)
    (on-table b89)
    (clear b354)
    (on b354 b15)
    (on b15 b331)
    (on b331 b350)
    (on b350 b210)
    (on b210 b205)
    (on-table b205)
    (clear b231)
    (on b231 b362)
    (on-table b362)
    (clear b254)
    (on b254 b285)
    (on b285 b189)
    (on b189 b147)
    (on b147 b194)
    (on b194 b265)
    (on b265 b361)
    (on b361 b246)
    (on b246 b312)
    (on-table b312)
    (clear b213)
    (on b213 b49)
    (on b49 b276)
    (on b276 b152)
    (on b152 b209)
    (on b209 b196)
    (on-table b196)
    (clear b379)
    (on b379 b368)
    (on-table b368)
    (clear b214)
    (on b214 b351)
    (on b351 b230)
    (on b230 b374)
    (on b374 b36)
    (on b36 b381)
    (on b381 b16)
    (on b16 b313)
    (on b313 b176)
    (on b176 b85)
    (on b85 b99)
    (on-table b99)
    (clear b236)
    (on b236 b293)
    (on b293 b183)
    (on b183 b35)
    (on b35 b142)
    (on b142 b124)
    (on b124 b291)
    (on b291 b51)
    (on b51 b306)
    (on b306 b364)
    (on-table b364)
    (clear b130)
    (on b130 b238)
    (on b238 b37)
    (on b37 b347)
    (on b347 b249)
    (on-table b249)
    (clear b193)
    (on b193 b190)
    (on-table b190)
    (clear b207)
    (on b207 b32)
    (on-table b32)
    (clear b96)
    (on b96 b129)
    (on b129 b185)
    (on-table b185)
    (clear b372)
    (on-table b372)
    (clear b224)
    (on-table b224)
    (clear b308)
    (on b308 b229)
    (on b229 b274)
    (on b274 b349)
    (on-table b349)
    (clear b79)
    (on-table b79)
    (clear b358)
    (on b358 b7)
    (on b7 b240)
    (on-table b240)
    (clear b360)
    (on b360 b325)
    (on b325 b221)
    (on-table b221)
    (clear b148)
    (on b148 b67)
    (on b67 b8)
    (on-table b8)
    (clear b200)
    (on-table b200)
    (clear b334)
    (on-table b334)
    (clear b38)
    (on-table b38)
    (clear b341)
    (on-table b341)
    (clear b165)
    (on b165 b22)
    (on-table b22)
    (clear b100)
    (on b100 b113)
    (on b113 b65)
    (on b65 b324)
    (on-table b324)
    (clear b342)
    (on-table b342)
    (clear b73)
    (on b73 b128)
    (on b128 b225)
    (on b225 b78)
    (on b78 b116)
    (on b116 b199)
    (on b199 b62)
    (on-table b62)
    (clear b321)
    (on b321 b28)
    (on-table b28)
    (clear b91)
    (on b91 b289)
    (on-table b289)
    (clear b82)
    (on b82 b57)
    (on b57 b156)
    (on b156 b338)
    (on-table b338)
    (clear b191)
    (on b191 b333)
    (on b333 b98)
    (on b98 b106)
    (on b106 b322)
    (on b322 b3)
    (on b3 b303)
    (on b303 b378)
    (on b378 b348)
    (on-table b348)
    (clear b74)
    (on b74 b63)
    (on b63 b167)
    (on b167 b160)
    (on b160 b283)
    (on b283 b21)
    (on b21 b357)
    (on b357 b256)
    (on b256 b118)
    (on b118 b177)
    (on b177 b314)
    (on-table b314)
    (clear b111)
    (on-table b111)
    (clear b141)
    (on b141 b174)
    (on-table b174)
    (clear b359)
    (on b359 b310)
    (on b310 b184)
    (on-table b184)
    (clear b339)
    (on-table b339)
    (clear b386)
    (on b386 b211)
    (on b211 b103)
    (on-table b103)
    (clear b175)
    (on-table b175)
    (clear b250)
    (on b250 b242)
    (on b242 b234)
    (on b234 b143)
    (on-table b143)
    (clear b12)
    (on b12 b327)
    (on b327 b307)
    (on b307 b311)
    (on b311 b71)
    (on-table b71)
    (clear b133)
    (on b133 b187)
    (on-table b187)
    (clear b260)
    (on b260 b50)
    (on b50 b149)
    (on-table b149)
    (clear b217)
    (on-table b217)
    (clear b171)
    (on b171 b169)
    (on b169 b261)
    (on b261 b385)
    (on-table b385)
    (clear b304)
    (on b304 b87)
    (on b87 b108)
    (on-table b108)
    (clear b298)
    (on-table b298)
    (clear b344)
    (on-table b344)
    (clear b380)
    (on b380 b188)
    (on b188 b216)
    (on-table b216)
    (clear b340)
    (on b340 b24)
    (on b24 b290)
    (on b290 b2)
    (on b2 b61)
    (on b61 b164)
    (on b164 b292)
    (on-table b292)
    (clear b343)
    (on-table b343)
    (clear b282)
    (on b282 b117)
    (on b117 b92)
    (on-table b92)
    (clear b60)
    (on b60 b150)
    (on b150 b299)
    (on b299 b206)
    (on-table b206)
    (clear b178)
    (on b178 b323)
    (on-table b323)
    (clear b23)
    (on b23 b4)
    (on b4 b101)
    (on b101 b11)
    (on b11 b186)
    (on-table b186)
    (clear b46)
    (on-table b46)
    (clear b123)
    (on b123 b288)
    (on b288 b370)
    (on b370 b14)
    (on-table b14)
    (clear b56)
    (on-table b56)
    (clear b375)
    (on b375 b42)
    (on-table b42)
    (clear b212)
    (on b212 b104)
    (on b104 b122)
    (on b122 b182)
    (on b182 b154)
    (on b154 b119)
    (on b119 b309)
    (on-table b309)
    (clear b369)
    (on b369 b346)
    (on b346 b247)
    (on b247 b81)
    (on b81 b54)
    (on b54 b181)
    (on b181 b320)
    (on b320 b139)
    (on b139 b144)
    (on b144 b295)
    (on b295 b30)
    (on b30 b64)
    (on b64 b273)
    (on b273 b52)
    (on-table b52)
    (clear b382)
    (on b382 b29)
    (on-table b29)
    (clear b168)
    (on b168 b136)
    (on b136 b27)
    (on b27 b208)
    (on b208 b302)
    (on b302 b253)
    (on b253 b55)
    (on b55 b70)
    (on b70 b228)
    (on b228 b280)
    (on b280 b337)
    (on-table b337)
    (clear b120)
    (on b120 b180)
    (on b180 b9)
    (on-table b9)
    (clear b226)
    (on b226 b115)
    (on-table b115)
    (clear b76)
    (on b76 b294)
    (on-table b294)
    (clear b18)
    (on b18 b245)
    (on b245 b127)
    (on b127 b75)
    (on b75 b69)
    (on b69 b255)
    (on b255 b203)
    (on-table b203)
    (clear b215)
    (on-table b215)
    (clear b244)
    (on-table b244)
    (clear b367)
    (on b367 b345)
    (on b345 b95)
    (on b95 b137)
    (on-table b137)
    (clear b25)
    (on b25 b84)
    (on b84 b173)
    (on b173 b296)
    (on b296 b373)
    (on-table b373)
    (clear b281)
    (on b281 b20)
    (on b20 b243)
    (on b243 b365)
    (on b365 b157)
    (on b157 b287)
    (on b287 b45)
    (on b45 b179)
    (on b179 b258)
    (on b258 b40)
    (on b40 b77)
    (on-table b77)
    (clear b102)
    (on b102 b363)
    (on-table b363)
    (clear b43)
    (on b43 b202)
    (on b202 b332)
    (on-table b332)
    (clear b138)
    (on b138 b41)
    (on b41 b159)
    (on-table b159)
    (clear b47)
    (on b47 b26)
    (on-table b26)
    (clear b31)
    (on b31 b39)
    (on b39 b318)
    (on b318 b297)
    (on b297 b317)
    (on b317 b232)
    (on b232 b241)
    (on b241 b162)
    (on-table b162)
    (clear b366)
    (on-table b366)
    (clear b121)
    (on b121 b286)
    (on b286 b263)
    (on b263 b34)
    (on b34 b222)
    (on b222 b107)
    (on b107 b264)
    (on b264 b13)
    (on-table b13)
    (clear b352)
    (on b352 b387)
    (on-table b387)
    (clear b371)
    (on b371 b259)
    (on b259 b271)
    (on b271 b270)
    (on b270 b305)
    (on-table b305)
    (clear b151)
    (on b151 b166)
    (on b166 b316)
    (on b316 b201)
    (on b201 b219)
    (on b219 b268)
    (on b268 b155)
    (on-table b155)
    (clear b227)
    (on b227 b153)
    (on b153 b248)
    (on b248 b1)
    (on b1 b277)
    (on-table b277)
    (clear b220)
    (on b220 b58)
    (on b58 b66)
    (on b66 b192)
    (on b192 b326)
    (on b326 b279)
    (on b279 b88)
    (on b88 b158)
    (on b158 b44)
    (on b44 b275)
    (on b275 b376)
    (on-table b376)
    (clear b384)
    (on b384 b278)
    (on b278 b163)
    (on b163 b93)
    (on-table b93)
    (clear b355)
    (on b355 b284)
    (on b284 b356)
    (on b356 b135)
    (on b135 b132)
    (on b132 b6)
    (on-table b6))
 (:goal  (and 
    (clear b2)
    (on b2 b4)
    (on b4 b8)
    (on b8 b3)
    (on b3 b7)
    (on b7 b6)
    (on b6 b9)
    (on b9 b1)
    (on b1 b11)
    (on b11 b10)
    (on b10 b5)
    (on-table b5))))

; plan
1. (unstack b120 b180)
   deleted: (on b120 b180) (clear b120) (arm-empty)
   added: (holding b120) (clear b180)
   goals met: 0 of 12
2. (putdown b120)
   deleted: (holding b120)
   added: (clear b120) (arm-empty) (on-table b120)
   goals met: 0 of 12
3. (unstack b148 b67)
   deleted: (on b148 b67) (clear b148) (arm-empty)
   added: (holding b148) (clear b67)
   goals met: 0 of 12
4. (putdown b148)
   deleted: (holding b148)
   added: (clear b148) (arm-empty) (on-table b148)
   goals met: 0 of 12
5. (unstack b180 b9)
   deleted: (on b180 b9) (clear b180) (arm-empty)
   added: (holding b180) (clear b9)
   goals met: 0 of 12
6. (putdown b180)
   deleted: (holding b180)
   added: (clear b180) (arm-empty) (on-table b180)
   goals met: 0 of 12
7. (unstack b191 b333)
   deleted: (on b191 b333) (clear b191) (arm-empty)
   added: (holding b191) (clear b333)
   goals met: 0 of 12
8. (putdown b191)
   deleted: (holding b191)
   added: (clear b191) (arm-empty) (on-table b191)
   goals met: 0 of 12
9. (unstack b227 b153)
   deleted: (on b227 b153) (clear b227) (arm-empty)
   added: (holding b227) (clear b153)
   goals met: 0 of 12
10. (putdown b227)
   deleted: (holding b227)
   added: (clear b227) (arm-empty) (on-table b227)
   goals met: 0 of 12
11. (unstack b153 b248)
   deleted: (on b153 b248) (clear b153) (arm-empty)
   added: (holding b153) (clear b248)
   goals met: 0 of 12
12. (putdown b153)
   deleted: (holding b153)
   added: (clear b153) (arm-empty) (on-table b153)
   goals met: 0 of 12
13. (unstack b23 b4)
   deleted: (on b23 b4) (clear b23) (arm-empty)
   added: (holding b23) (clear b4)
   goals met: 0 of 12
14. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 0 of 12
15. (unstack b248 b1)
   deleted: (on b248 b1) (clear b248) (arm-empty)
   added: (holding b248) (clear b1)
   goals met: 0 of 12
16. (putdown b248)
   deleted: (holding b248)
   added: (clear b248) (arm-empty) (on-table b248)
   goals met: 0 of 12
17. (unstack b262 b197)
   deleted: (on b262 b197) (clear b262) (arm-empty)
   added: (holding b262) (clear b197)
   goals met: 0 of 12
18. (putdown b262)
   deleted: (holding b262)
   added: (clear b262) (arm-empty) (on-table b262)
   goals met: 0 of 12
19. (unstack b197 b266)
   deleted: (on b197 b266) (clear b197) (arm-empty)
   added: (holding b197) (clear b266)
   goals met: 0 of 12
20. (putdown b197)
   deleted: (holding b197)
   added: (clear b197) (arm-empty) (on-table b197)
   goals met: 0 of 12
21. (unstack b266 b5)
   deleted: (on b266 b5) (clear b266) (arm-empty)
   added: (holding b266) (clear b5)
   goals met: 0 of 12
22. (putdown b266)
   deleted: (holding b266)
   added: (clear b266) (arm-empty) (on-table b266)
   goals met: 0 of 12
23. (unstack b5 b315)
   deleted: (on b5 b315) (clear b5) (arm-empty)
   added: (holding b5) (clear b315)
   goals met: 0 of 12
24. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 12
25. (unstack b333 b98)
   deleted: (on b333 b98) (clear b333) (arm-empty)
   added: (holding b333) (clear b98)
   goals met: 1 of 12
26. (putdown b333)
   deleted: (holding b333)
   added: (clear b333) (arm-empty) (on-table b333)
   goals met: 1 of 12
27. (unstack b340 b24)
   deleted: (on b340 b24) (clear b340) (arm-empty)
   added: (holding b340) (clear b24)
   goals met: 1 of 12
28. (putdown b340)
   deleted: (holding b340)
   added: (clear b340) (arm-empty) (on-table b340)
   goals met: 1 of 12
29. (unstack b24 b290)
   deleted: (on b24 b290) (clear b24) (arm-empty)
   added: (holding b24) (clear b290)
   goals met: 1 of 12
30. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 1 of 12
31. (unstack b290 b2)
   deleted: (on b290 b2) (clear b290) (arm-empty)
   added: (holding b290) (clear b2)
   goals met: 2 of 12
32. (putdown b290)
   deleted: (holding b290)
   added: (clear b290) (arm-empty) (on-table b290)
   goals met: 2 of 12
33. (unstack b355 b284)
   deleted: (on b355 b284) (clear b355) (arm-empty)
   added: (holding b355) (clear b284)
   goals met: 2 of 12
34. (putdown b355)
   deleted: (holding b355)
   added: (clear b355) (arm-empty) (on-table b355)
   goals met: 2 of 12
35. (unstack b284 b356)
   deleted: (on b284 b356) (clear b284) (arm-empty)
   added: (holding b284) (clear b356)
   goals met: 2 of 12
36. (putdown b284)
   deleted: (holding b284)
   added: (clear b284) (arm-empty) (on-table b284)
   goals met: 2 of 12
37. (unstack b356 b135)
   deleted: (on b356 b135) (clear b356) (arm-empty)
   added: (holding b356) (clear b135)
   goals met: 2 of 12
38. (putdown b356)
   deleted: (holding b356)
   added: (clear b356) (arm-empty) (on-table b356)
   goals met: 2 of 12
39. (unstack b135 b132)
   deleted: (on b135 b132) (clear b135) (arm-empty)
   added: (holding b135) (clear b132)
   goals met: 2 of 12
40. (putdown b135)
   deleted: (holding b135)
   added: (clear b135) (arm-empty) (on-table b135)
   goals met: 2 of 12
41. (unstack b132 b6)
   deleted: (on b132 b6) (clear b132) (arm-empty)
   added: (holding b132) (clear b6)
   goals met: 2 of 12
42. (putdown b132)
   deleted: (holding b132)
   added: (clear b132) (arm-empty) (on-table b132)
   goals met: 2 of 12
43. (unstack b358 b7)
   deleted: (on b358 b7) (clear b358) (arm-empty)
   added: (holding b358) (clear b7)
   goals met: 2 of 12
44. (putdown b358)
   deleted: (holding b358)
   added: (clear b358) (arm-empty) (on-table b358)
   goals met: 2 of 12
45. (unstack b67 b8)
   deleted: (on b67 b8) (clear b67) (arm-empty)
   added: (holding b67) (clear b8)
   goals met: 2 of 12
46. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 2 of 12
47. (unstack b80 b204)
   deleted: (on b80 b204) (clear b80) (arm-empty)
   added: (holding b80) (clear b204)
   goals met: 2 of 12
48. (putdown b80)
   deleted: (holding b80)
   added: (clear b80) (arm-empty) (on-table b80)
   goals met: 2 of 12
49. (unstack b204 b10)
   deleted: (on b204 b10) (clear b204) (arm-empty)
   added: (holding b204) (clear b10)
   goals met: 2 of 12
50. (putdown b204)
   deleted: (holding b204)
   added: (clear b204) (arm-empty) (on-table b204)
   goals met: 2 of 12
51. (unstack b98 b106)
   deleted: (on b98 b106) (clear b98) (arm-empty)
   added: (holding b98) (clear b106)
   goals met: 2 of 12
52. (putdown b98)
   deleted: (holding b98)
   added: (clear b98) (arm-empty) (on-table b98)
   goals met: 2 of 12
53. (unstack b106 b322)
   deleted: (on b106 b322) (clear b106) (arm-empty)
   added: (holding b106) (clear b322)
   goals met: 2 of 12
54. (putdown b106)
   deleted: (holding b106)
   added: (clear b106) (arm-empty) (on-table b106)
   goals met: 2 of 12
55. (unstack b322 b3)
   deleted: (on b322 b3) (clear b322) (arm-empty)
   added: (holding b322) (clear b3)
   goals met: 2 of 12
56. (putdown b322)
   deleted: (holding b322)
   added: (clear b322) (arm-empty) (on-table b322)
   goals met: 2 of 12
57. (unstack b4 b101)
   deleted: (on b4 b101) (clear b4) (arm-empty)
   added: (holding b4) (clear b101)
   goals met: 2 of 12
58. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 12
59. (unstack b101 b11)
   deleted: (on b101 b11) (clear b101) (arm-empty)
   added: (holding b101) (clear b11)
   goals met: 2 of 12
60. (putdown b101)
   deleted: (holding b101)
   added: (clear b101) (arm-empty) (on-table b101)
   goals met: 2 of 12
61. (unstack b10 b383)
   deleted: (on b10 b383) (clear b10) (arm-empty)
   added: (holding b10) (clear b383)
   goals met: 2 of 12
62. (stack b10 b5)
   deleted: (clear b5) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b5)
   goals met: 3 of 12
63. (unstack b11 b186)
   deleted: (on b11 b186) (clear b11) (arm-empty)
   added: (holding b11) (clear b186)
   goals met: 3 of 12
64. (stack b11 b10)
   deleted: (clear b10) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b10)
   goals met: 4 of 12
65. (unstack b1 b277)
   deleted: (on b1 b277) (clear b1) (arm-empty)
   added: (holding b1) (clear b277)
   goals met: 4 of 12
66. (stack b1 b11)
   deleted: (clear b11) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b11)
   goals met: 5 of 12
67. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 5 of 12
68. (stack b9 b1)
   deleted: (clear b1) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b1)
   goals met: 6 of 12
69. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 6 of 12
70. (stack b6 b9)
   deleted: (clear b9) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b9)
   goals met: 7 of 12
71. (unstack b7 b240)
   deleted: (on b7 b240) (clear b7) (arm-empty)
   added: (holding b7) (clear b240)
   goals met: 7 of 12
72. (stack b7 b6)
   deleted: (clear b6) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b6)
   goals met: 8 of 12
73. (unstack b3 b303)
   deleted: (on b3 b303) (clear b3) (arm-empty)
   added: (holding b3) (clear b303)
   goals met: 8 of 12
74. (stack b3 b7)
   deleted: (clear b7) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b7)
   goals met: 9 of 12
75. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 9 of 12
76. (stack b8 b3)
   deleted: (clear b3) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b3)
   goals met: 10 of 12
77. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 10 of 12
78. (stack b4 b8)
   deleted: (clear b8) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b8)
   goals met: 11 of 12
79. (unstack b2 b61)
   deleted: (on b2 b61) (clear b2) (arm-empty)
   added: (holding b2) (clear b61)
   goals met: 10 of 12
80. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 12 of 12
